Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/gp_and_hospital_services/hospital_services_introduction.html.txt.tmx
Source language: en
Languages: ga

source: Overview of hospital services
ga: Seirbhísí Ospidéil - Réamhrá

source: There are three different types of hospital provision in Ireland:
ga: Tá trí chineál éagsúla de sholáthar ospidéil in Éirinn

source: • Health Service Executive (HSE) hospitals, owned and funded by the HSE
ga: • Ospidéil Fheidhmeannacht na Seirbhíse Sláinte (FSS), atá faoi úinéireacht FSS agus atá á maoiniú aici

source: • Voluntary public hospitals, most of whose income comes from State funds
ga: • Ospidéil dheonacha phoiblí, a dtagann an chuid is mó dá n-ioncam ó chistí an Stáit

source: Voluntary public hospitals are sometimes owned by private bodies, for example, religious orders
ga: I gcásanna áirithe, tá ospidéil dheonacha phoiblí faoi úinéireacht comhlachtaí poiblí, mar shampla, oird rialta

source: Other voluntary public hospitals are incorporated by charter or statute and are run by boards often appointed by the Minister for Health
ga: Is corpraithe le cairt nó le reacht atá ospidéil dheonacha phoiblí eile, agus iad á reáchtáil ag boird, a gceapann an tAire Sláinte iad go minic

source: • Private hospitals, which receive no State funding
ga: • Ospidéil phríobháideacha, nach bhfaigheann aon mhaoiniú ón Stát

source: Public health services are provided in HSE hospitals and public voluntary hospitals and in practice there is very little difference between these two types of hospital
ga: Is in ospidéil FSS agus in ospidéil dheonacha poiblí a chuirtear seirbhísí sláinte poiblí ar fáil. Is beag difríocht idir an dá chineál sin d’ospidéal sa chleachtas

source: Most of these hospitals also provide private health care but they must clearly distinguish between public and private beds
ga: Cuireann formhór na n-ospidéal sin cúram sláinte príobháideach ar fáil freisin, ach ní mór dóibh idirdhealú soiléir a dhéanamh idir leapacha poiblí agus leapacha príobháideacha

source: There are a number of purely private hospitals that operate independently of state health services
ga: Is ann do roinnt ospidéal nach gcuireann ach seirbhísí sláinte príobháideacha amháin ar fáil

source: If you opt for private care in a private hospital, you must pay the full cost of treatment and maintenance
ga: Má roghnaíonn tú chun cúram príobháideach a fháil in ospidéal príobháideach, ní mór duit lánchostas na cóireála agus na cothabhála a íoc

source: Acute hospital services diagnose, treat and care for seriously ill or injured patients
ga: Diagnóisíonn seirbhísí ospidéil ghéarmhíochaine othair atá an-tinn nó an-ghortaithe, cuireann siad cóireáil orthu agus tugann siad aire orthu

source: Acute hospital services are provided in HSE hospitals, public voluntary hospitals and private hospitals
ga: Is in ospidéil FSS, in ospidéil dheonacha phoiblí agus in ospidéil phríobháideacha a chuirtear seirbhísí ospidéil ghéarmhíochaine

source: Some hospitals are specialist, for example, maternity or psychiatric hospitals, while others are general
ga: Is sainospidéil atá in ospidéil áirithe, mar shampla, ospidéil mháithreachais nó ospidéil shíciatracha, agus is ospidéil ghinearálta atá i gcinn eile

source: The large general and regional hospitals provide a broad range of services
ga: Cuireann na hospidéil ghinearálta mhóra agus réigiúnacha raon leathan seirbhísí ar fáil

source: Smaller local hospitals may not be able to cater for all illnesses and treatments and you may have to be transferred to a larger hospital or to a specialist hospital
ga: D'fhéadfadh nach mbeadh na hospidéil áitiúla bheaga in ann freastal ar gach cineál galair agus cóireála agus d'fhéadfadh gur ghá tú a aistriú chuig ospidéal níos mó nó chuig sainospidéal

source: In-patient services are institutional services provided for people in hospitals, convalescent homes or homes for people with physical or mental disabilities
ga: Is é is seirbhísí othair chónaithigh ann ná seirbhísí institiúideacha a chuirtear ar fáil do dhaoine in ospidéil, in ionaid téarnaimh nó in ionaid do dhaoine faoi mhíchumas fisiciúil nó meabhrach

source: Day-case treatment is regarded as an in-patient service but you do not stay in hospital overnight
ga: Féachtar ar chóireáil cás lae mar sheirbhís othair chónaithigh, ach ní fhanann an t-othar san ospidéal thar oíche

source: Out-patient services are generally taken to include accident and emergency services as well as planned services provided on an out-patient basis
ga: De ghnáth, glactar leis go n-áirítear le seirbhísí othair sheachtraigh seirbhísí timpistí agus éigeandála, mar aon le seirbhísí pleanáilte a sholáthraítear ar bhonn othar seachtrach

source: For example, you may be referred by your family doctor (GP) for specialist assessment by a consultant or his or her team or for diagnostic assessments such as x-rays or laboratory tests or for treatment such as physiotherapy
ga: Mar shampla, d’fhéadfadh go ndéanfadh do dhochtúir teaghlaigh (LG) tú a atreorú do shainmheasúnú ag comhairleach nó ag a f(h)oireann, do mheasúnuithe diagnóiseacha ar nós x-ghathanna nó tástálacha saotharlainne nó do chóireáil ar nós fisiteiripe

source: As a public patient, you do not have to pay for consultants' services and you do not have a choice of consultants
ga: Agus tú i d’othar poiblí, ní gá duit íoc as seirbhísí comhairleach agus ní féidir leat do chomhairleach a roghnú

source: In many areas, there are waiting lists for non-emergency services
ga: Tá liosta feithimh le haghaidh seirbhísí neamhéigeandála ann i mórán ceantar

source: Information on waiting times for in-patient treatment is available online
ga: Tá faisnéis ar amanna feithimh le haghaidh cóireáil othair chónaithigh ar fáil ar líne

source: If you choose to be a private patient in a public hospital, you become the private patient of the consultant treating you and you must pay for all consultant services provided to you
ga: Má roghnaíonn tú chun a bheith i d’othar príobháideach in ospidéal poiblí, caitear leat mar othar príobháideach de chuid an chomhairligh a bhfuil cóireáil á cur aige/aici ort agus ní mór duit íoc as gach ceann de na seirbhísí a chuireann an comhairleach ar fáil duit

source: There is also a set daily charge for private patients in public hospitals
ga: Tá táille laethúil shocraithe ann i leith othair phríobháideacha in ospidéil phoiblí freisin

source: Private hospitals are free to set their own charges to patients
ga: Is féidir le hospidéil phríobháideacha a dtáillí féin a shocrú i leith othar

source: Private health insurance may cover some or all of the costs involved
ga: D’fhéadfadh go ndéanfadh árachas sláinte príobháideach na costais uile atá i gceist, nó cuid díobh, a chlúdach

source: Deaf and hard of hearing patients are entitled to interpretation services in public hospitals in Ireland
ga: Tá othair atá bodhar nó a bhfuil moill éisteachta orthu i dteideal seirbhísí ateangaireachta in ospidéil phoiblí in Éirinn

source: You should notify the hospital that you are deaf or hard of hearing in advance of your visit so they can make any necessary arrangements
ga: Ba chóir duit fógra a thabhairt don ospidéal go bhfuil tú bodhar nó go bhfuil moill éisteachta ort roimh an gcuairt chun gur féidir leis na socruithe is gá a dhéanamh

source: Further information regarding these services is available from the Director of Disability Services at your Local Health Office
ga: Tá tuilleadh faisnéise faoi na seirbhísí sin ar fáil ó Stiúrthóir na Seirbhísí Míchumais ag d’Oifig Áitiúil Sláinte

source: Public and voluntary hospitals are subject to Freedom of Information legislation
ga: Tá ospidéil phoiblí agus dheonacha faoi réir reachtaíocht Saoráil Faisnéise

source: This means, among other things, that they are obliged to publish information about their structures, services and practices
ga: Fágann sé sin, i measc nithe eile, go bhfuil dualgas orthu faisnéis a fhoilsiú faoina gcuid struchtúr, seirbhísí agus cleachtas

source: If the hospital holds personal information about you, you can access those records
ga: Má tá faisnéis fút á coinneáil ag an ospidéal, tá tú i dteideal teacht ar na taifid sin

source: See our document on hospital charges for details of the charges that may apply and who is exempt from charges
ga: Féach ár gcáipéis maidir le táillí ospidéil le haghaidh sonraí faoi na táillí a d’fhéadfadh bheith ann agus faoi cé atá díolmhaithe ó tháillí

source: You should obtain a letter of referral from your GP if you need to receive hospital treatment
ga: Ba chóir duit litir atreoraithe a fháil ó do LG má theastaíonn cóireáil ospidéil uait

source: You can attend accident and emergency departments in most general hospitals and some specialist hospitals without a letter of referral but you may be charged for your visit
ga: Is féidir leat freastal ar rannóga timpistí agus éigeandála i bhformhór na n-ospidéal ginearálta agus i roinnt sainospidéal gan litir atreoraithe a bheith agat, agus d’fhéadfadh go ngearrfaí táille ort i leith do chuairte

source: View contact information for public hospitals in your area
ga: Féach an fhaisnéis teagmhála d’ospidéil phoiblí i do cheantar
